Repository: rinrinne/IDEA_resources_jp
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: Backup previously generated files
ja: 前回生成したファイルをバックアップする

source: Bad file mask "{0}"
ja: 不正なファイルマスク "{0}"

source: Base Ctr call
ja: ベース コンストラクタ呼び出し

source: Base on This Class
ja: このクラスをベースにする

source: Base on This Interface
ja: このインターフェイスをベースにする

source: Base on This Method
ja: このメソッドをベースにする

source: Based on keymap: {0}
ja: ベースのキーマップ: {0}

source: Basic Completion
ja: ベーシック

source: Basic code completion
ja: 基本コードの補完

source: Basic options
ja: 基本オプション

source: Before ':'
ja: ':' の前

source: Before '?'
ja: '?' の前

source: Before '}':
ja: '}' の前:

source: Before Compilation
ja: コンパイル前

source: Before Left Brace
ja: 左中括弧の前

source: Before Parentheses
ja: 小括弧の前

source: Before Run/Debug
ja: 実行/デバッグ前

source: Before Run/Debug...
ja: 実行/デバッグの前に...

source: Before comma
ja: カンマの前

source: Before imports:
ja: import の前:

source: Before method body:
ja: メソッド本体の前:

source: Before package statement:
ja: package 文の前:

source: Before semicolon
ja: セミコロンの前

source: Behavior
ja: 動作

source: Binary files are different
ja: バイナリファイルは異なります

source: Binary files are identical
ja: バイナリ ファイルは同一です

source: Binary operation
ja: バイナリ演算

source: Bitwise operation issues
ja: ビット操作問題

source: Bitwise operators (\&, |, ^)
ja: ビット演算子 (\&、|、^)

source: Blank Lines
ja: 空白行

source: Blank lines
ja: 空白行

source: Block comment
ja: ブロック コメント

source: Block comment at first column
ja: 最初の列にブロック コメントを入れる

source: Block comment end:
ja: ブロック コメントの終了:

source: Block comment start:
ja: ブロック コメントの開始:

source: Bold
ja: 太字

source: Bold Underscored
ja: 太字下線付き

source: Boolean value expected
ja: Boolean 値が必要です

source: Bordered
ja: 境界線付き

source: Bottom
ja: 下

source: Braces Placement
ja: 中括弧の配置

source: Braces and Operators//Operator sign
ja: 演算子符号

source: Brackets
ja: 大括弧内

source: Brackets:
ja: 大括弧:

source: Breakpoint Action Error
ja: ブレークポイント動作エラー

source: Breakpoint Condition Error
ja: ブレークポイント条件エラー

source: Breakpoint at line {0}
ja: 行 {0} のブレークポイント

source: Breakpoint does not belong to any class
ja: ブレークポイントはどのクラスにも属していません

source: Breakpoint reached
ja: ブレークポイントに達しました

source: Breakpoint reached at {0}
ja: ブレークポイント {0} に達しました。

source: Breakpoint reached at {0}({1}:{2,number,#})
ja: ブレークポイント {0} に達しました。行({1}: {2,number,#})

source: Breakpoints will be ignored for the obsolete version of the method
ja: ブレークポイントは、以前のバージョンのメソッドでは無視されます

source: Breakpoints will be unavailable in this class.
ja: ブレークポイントはこのクラスでは利用できません。

source: Bring ''{0}'' into scope
ja: ''{0}'' をスコープに入れる

source: Bring Variable to Scope
ja: 変数をスコープに入れる

source: Browse Call Hierarchy
ja: 呼び出し階層の参照

source: Browse Icon
ja: アイコンの参照

source: Browse Method Hierarchy
ja: メソッド階層の参照

source: Browse Output directory
ja: 出力ディレクトリの参照

source: Browse Type Hierarchy
ja: タイプ階層の参照

source: Browse external documentation
ja: 外部 javadoc の参照

source: Browse icon for selected action (*.png)
ja: 選択したアクションのアイコンを参照してください(*.png)

source: Browser Error
ja: ブラウザエラー

source: Browser Not Found
ja: ブラウザが見つかりません

source: Build #{0}
ja: ビルド #{}

source: Build File Properties
ja: ビルド ファイル プロパティ

source: Build initialization
ja: ビルドの初期化

source: Build sequence {0}
ja: ビルド シーケンス {0}

source: Build:
ja: ビルド:

source: Bundled Ant
ja: バンドルされた Ant

source: By Scope
ja: スコープ ベース

source: C&lass
ja: クラス (&L)

source: C&lass filters:
ja: クラス フィルタ(&L):

source: C_lose
ja: 閉じる(_L)

source: C_opy Path
ja: パスのコピー(_O)

source: C_opy Paths
ja: パスのコピー(_O)

source: Calculating number of pages...
ja: ページ数を計算している

source: Call arguments
ja: 引数呼び出し

source: Callee Methods Hierarchy
ja: 呼び出し先メソッドの階層

source: Callees of {0}
ja: {0} の呼び出し先

source: Caller Methods Hierarchy
ja: 呼び出し元メソッドの階層

source: Callers of {0}
ja: {0} の呼び出し元

source: Can be simplified
ja: 簡素化できます

source: Can be {0}
ja: {0} 設定

source: Can''t read from {0}
ja: {0} から読み込めません

source: Can''t resolve property: {0}
ja: プロパティを解決できません : {0}

source: Can't Browse TestCase Inheritors
ja: テストケースの継承者を参照できません

source: Can't Launch Diff Tool
ja: 差分ツールを起動できません

source: Cancel
ja: キャンセル

source: Canceled by user
ja: ユーザーによって取り消されました

source: Cannot Add Build File
ja: ビルド ファイルを追加できません

source: Cannot Add Files
ja: ファイルを追加できません

source: Cannot Create @interface
ja: @interface を作成できません

source: Cannot Create Enum
ja: 新規 Enum を作成できません

source: Cannot Create Interface
ja: インターフェイスを作成できません

source: Cannot Load Project
ja: プロジェクトを読み込めません

source: Cannot Modify Read-Only Files
ja: 読み取り専用ファイルは変更できません

source: Cannot Open File
ja: ファイルが開けません

source: Cannot Open Project
ja: プロジェクトが開けません

source: Cannot Redo
ja: やり直せません

source: Cannot Run ANT
ja: ANT を実行できません

source: Cannot Save Current Template
ja: 現在のテンプレートを保存できません

source: Cannot Save Settings
ja: 設定を保存できません

source: Cannot Search for Usages
ja: 使用箇所を検索できません。

source: Cannot Undo
ja: 元に戻せません

source: Cannot add build files from excluded directories {0}
ja: 除外ディレクトリからのビルド ファイルを追加できません {0}

source: Cannot add constructor to an anonymous class
ja: コンストラクタを匿名クラスに追加できません

source: Cannot add file {0}: {1}
ja: ファイル {0} を追加できません: {1}

source: Cannot add watchpoint: a class name is not specified
ja: ウォッチポイントを追加できません : クラス名の指定がありません

source: Cannot add watchpoint: a field name is not specified
ja: ウォッチポイントを追加できません : フィールド名の指定がありません

source: Cannot cast boolean value to ''{0}''
ja: boolean 値を ''{0}'' にキャストできません

source: Cannot cast char value to ''{0}''
ja: char 値を ''{0}'' にキャストできません

source: Cannot cast null to ''{0}''
ja: NULL を ''{0}'' にキャストできません

source: Cannot cast numeric value to ''{0}''
ja: numeric 値を ''{0}'' にキャストできません

source: Cannot change field ''{0}'' type.
ja: フィールド ''{0}'' の型を変更できません。

source: Cannot connect to remote process, host is unknown
ja: リモート プロセスに接続できません。ホストが不明です

source: Cannot connect using transport ''{0}'': required connector not found.
ja: トランスポート ''{0}'' を使用して接続できません : 必要な接続がありません。

source: Cannot create a field watchpoint for ''{0}.{1}''.
ja: ''{0}.{1}'' のフィールド ウォッチポイントを作成できません。

source: Cannot create expression from code fragment.
ja: 式をコード フラグメントから作成できません。

source: Cannot create void value
ja: void 値を作成できません

source: Cannot create {0} - incorrect {1} template.
ja: {0} でファイルをスキャンしています...

source: Cannot create {0} in {1}: {2}
ja: {1} で {0} を作成できません : {2}

source: Cannot create {0}.java in {1}: {2}
ja: {1} で {0}.java を作成できません : {2}

source: Cannot evaluate array initializer
ja: 配列初期化子を評価できません

source: Cannot evaluate class type
ja: クラス タイプを評価できません

source: Cannot evaluate descendants, object was collected.
ja: 子孫を評価できません。オブジェクトを収集しました。

source: Cannot evaluate qualifier ''{0}''
ja: 限定子 ''{0}'' を評価できません

source: Cannot evaluate {0}.toString()
ja: {0}.toString() を評価できません

source: Cannot evaluate: process exited
ja: 評価できません : プロセスは終了しました

source: Cannot evaluate: stack frame unavailable
ja: 評価できません : スタックフレームは利用できません

source: Cannot evaluate: thread is not paused at breakpoint
ja: 評価できません : スレッドはブレークポイントで一時停止しません

source: Cannot find field ''{0}'' in class ''{1}''
ja: クラス ''{1}'' にフィールド ''{0}'' がありません

source: Cannot find file {0}
ja: ファイル {0} が見つかりません

source: Cannot find local variable ''{0}''
ja: ローカル変数 ''{0}'' がありません

source: Cannot find source class for current stack frame
ja: 現在のスタック フレームのソース クラスがありません

source: Cannot find sources for class containing field ''{0}''
ja: フィールド ''{0}'' を格納するクラスのリソースがありません

source: Cannot generate equals() and hashCode().
ja: equals() と hashCode() を生成できません。

source: Cannot initialize array
ja: 配列を初期化できません

source: Cannot load file ''{0}''; breakpoints for this file will be ignored
ja: ファイル ''{0}'' を読み込めません。このファイルのブレークポイントは無視されます

source: Cannot load project: {0}
ja: プロジェクトを読み込めません: {0}

source: Cannot load {0}.
ja: {0} を読み込めません。

source: Cannot pop bottom frame
ja: ボトム フレームをポップできません

source: Cannot redo
ja: やり直せません

source: Cannot resolve
ja: 解決できません

source: Cannot resolve class ''{0}''
ja: クラス ''{0}'' を解決できません

source: Cannot resolve class containing field ''{0}''
ja: フィールド ''{0}'' を格納するクラスを解決できません

source: Cannot resolve constructor ''{0}''
ja: コンストラクタ ''{0}'' を解決できません

source: Cannot search for usages.
ja: 使用箇所を検索できません。

source: Cannot start debugger: debug libraries are missig from JDK home
ja: デバッガを開始できません : デバッグ ライブラリが JDK ホームにありません

source: Cannot start {0}
ja: {0} を開始できません

source: Cannot substitute ''{0}'' into ''{1}'' as ''this''
ja: ''{0}'' を ''{1}'' に ''this'' として代替できません

source: Cannot undo
ja: 元に戻せません

source: Captured snapshot ''{0}'' is placed in user home directory.
ja: キャプチャしたスナップショット"{0}"はユーザー ホーム ディレクトリに格納されます。

source: Caret blinking (ms):
ja: キャレットの点滅間隔（ミリ秒）:

source: Case Sensitive
ja: 大文字/小文字を区別する

source: Case sensitive completion:
ja: 大文字/小文字を区別する補完:

source: Cast parameter to ''{0}''
ja: パラメータを ''{0}'' にキャストする

source: Cast to ''{0}''
ja: ''{0}'' にキャストする

source: Cast {0, choice, 1#1st|2#2nd|3#3rd|4#{0,number}th} parameter to ''{1}''
ja: {0, choice, 1\#1st|2\#2nd|3\#3rd|4\#{0,number}th} パラメータを ''{1}'' にキャストする

source: Casting {0} to {1} is redundant
ja: {0} の {1} へのキャストは冗長です

source: Category
ja: カテゴリ

source: Caught exceptio&n
ja: 捕捉した例外(&N)

source: Center
ja: 中央

source: Change ''{0} {2}'' to ''{1} {2}''
ja: ''{0} {2}'' を ''{1} {2}'' に変更する

source: Change Directory...
ja: ディレクトリの変更...

source: Change GUI component type
ja: GUI コンポーネントの型を変更する

source: Change Inheritors
ja: 継承の変更

source: Change Parameter Class
ja: パラメータ クラスの変更

source: Change bound field type
ja: 結合フィールドの型を変更する

source: Change method signature from usage
ja: 使用箇所からメソッド シグネチャを変更する

source: Change notes
ja: 変更履歴

source: Change signature of ''{0}'' to ''{1}({2})''
ja: ''{0}'' のシグネチャを ''{1}({2})'' に変更する

source: Change to ''!({0})''
ja: ''\!({0})'' に変更する

source: Change {0} ''{1}'' type to ''{2}''
ja: ''{0}'' の型を ''{1}'' に変更する

source: Changed
ja: 変更

source: Changed Files
ja: 変更されたファイル

source: Check your JDK installation.
ja: JDK インストールを確認してください。

source: Choose &fields to be included in equals()
ja: equals() に含めるフィールドの選択(&F)

source: Choose &fields to be included in hashCode()
ja: hashCode() に含めるフィールドの選択(&F)

source: Choose Action Icon
ja: アクションのアイコンを選択

source: Choose Actions To Add
ja: 追加するアクションの選択

source: Choose Applet Class
ja: アプレット クラスの選択

source: Choose Base Class of the Hierarchy to Search In
ja: 検索する階層のベース クラスを選択してください

source: Choose Code Style Scheme
ja: コード スタイル スキームの選択

source: Choose Date
ja: 日付の選択

source: Choose Destination Directory
ja: 作成先ディレクトリの選択

source: Choose Field's class
ja: フィールドのクラスを選択

source: Choose Fields to Initialize by Constructor
ja: コンストラクタで初期化するフィールドを選択してください

source: Choose HTML File
ja: HTML ファイルの選択

source: Choose Main Class
ja: メイン クラスの選択

source: Choose Package
ja: パッケージの選択

source: Choose Super Class Constructor
ja: スーパー クラス コンストラクタの選択

source: Choose Super Class Constructors
ja: スーパー クラス コンストラクタの選択

source: Choose Super Method of {0}
ja: {0} のスーパー メソッドの選択

source: Choose Target Class
ja: ターゲット クラスの選択

source: Choose Test Class
ja: テスト クラスの選択

source: Choose Test Method
ja: テスト メソッドの選択

source: Choose export file path or directory where to create new file
ja: エクスポート先のファイルまたは新規ファイルを作成するディレクトリを選択してください

source: Chop down if long.
ja: 長い場合に切り捨てる

source: Class
ja: クラス

source: Class ''{0}'' is not loaded
ja: クラス ''{0}'' は読み込まれていません

source: Class ''{0}'' not found in module ''{1}''
ja: クラス "{0}" がモジュール "{1}" にありません

source: Class Exclusion Filters
ja: クラス除外フィルタ

source: Class Filters
ja: クラス フィルタ

source: Class Hierarchy
ja: クラス階層

source: Class at {0}:{1}
ja: {0} でのクラス :{1}

source: Class circularity error : {0}
ja: クラスの循環エラー : {0}

source: Class definition not found : {0}
ja: クラス定義がありません : {0}

source: Class filters
ja: クラス フィルタ

source: Class format error : {0}
ja: クラス フォーマット エラー : {0}

source: Class has no fields
ja: クラスにはフィールドがありません

source: Class has {0} defined but does not define {1}
ja: クラスでは {0} が定義されていますが {1} が定義されていません

source: Class left brace
ja: クラスの左中括弧

source: Class metrics
ja: クラス メトリクス

source: Class name
ja: クラス名

source: Class not loaded : {0}
ja: クラスが読み込まれていません : {0}

source: Class not specified.
ja: クラスが指定されていません

source: Class or array type expected while evaluating field ''{0}''
ja: クラスまたは配列タイプは、フィールド ''{0}'' の評価に必要です。

source: Class structure
ja: クラス構造

source: Class to Import
ja: インポートするクラス

source: Class {0}
ja: クラス {0}

source: Class&path:
ja: クラスパス(&P):

source: Clear All
ja: すべて削除

source: Clear Filtering
ja: フィルタの消去

source: Clear Recent Projects List
ja: 最近開いたプロジェクト一覧のクリア

source: Click Count
ja: クリック回数

source: Click Pad
ja: クリック パッド

source: Click here to enter mouse shortcut
ja: ここをクリックしてマウス ショートカットを入力します

source: Clipboard vs Editor
ja: クリップボード vs エディタ

source: Clipboard vs {0}
ja: クリップボードと {0}

source: Cloning issues
ja: クローン問題

source: Close
ja: 閉じる

source: Close Active Editor
ja: アクティブなエディタを閉じる

source: Close All Editors
ja: すべてのエディタを閉じる

source: Close All Unmodified Editors
ja: 変更していないすべてのエディタを閉じる

source: Close Annotations
ja: 注釈を閉じる

source: Close Ant Build Messages
ja: Ant ビルド メッセージを閉じる

source: Close _All
ja: すべてのエディタを閉じる(_A)

source: Close _All In Group
ja: タブ グループ内のすべてのエディタを閉じる(_A)

source: Close _Unmodified
ja: 変更していないすべてのエディタを閉じる(_U)

source: Close _Unmodified In Group
ja: タブ グループ内で変更していないすべてのエディタを閉じる(_U)

source: Close less frequently used files
ja: 使用頻度の低いファイルを閉じる

source: Close non-modified files first
ja: 未変更のファイルを最初に閉じる

source: Co&ndition:
ja: 条件(&N):

source: Code
ja: コード

source: Code Assistants
ja: コード アシスタント

source: Code Completion
ja: コード補完

source: Code Duplication Analysis
ja: コードの重複分析

source: Code Duplication Analysis Settings
ja: コード重複分析設定

source: Code Editing
ja: コード編集

source: Code Folding
ja: コードの折りたたみ

source: Code Fragment &Mode
ja: コード フラグメント モード

source: Code Fragment Evaluation
ja: コード フラグメント評価

source: Code Generation
ja: コード生成

source: Code Inspection results
ja: コード検査結果

source: Code fragment expected
ja: コード フラグメントが必要です

source: Code maturity issues
ja: コード成熟度問題

source: Code style issues
ja: コード スタイル問題

source: Collapse All
ja: すべて折り畳み

source: Collapse all build file nodes
ja: すべてのビルド ファイル ノードを収縮

source: Collapse all test suites
ja: すべてのテスト スイートを折り畳む

source: Color printing
ja: カラー印刷

source: Colors \& Fonts
ja: 色とフォント

source: Column number
ja: 列番号

source: Commander
ja: コマンダ

source: Commander View Popup Menu
ja: コマンダ ビュー ポップアップ メニュー

source: Comment
ja: コメント

source: Comment Code
ja: コメント コード

source: Comment/Uncomment block
ja: ブロックのコメント化/非コメント化

source: Comment/Uncomment current line
ja: 現在の行のコメント化/非コメント化

source: Compact Empty Middle Packages
ja: 空の中間パッケージの収縮

source: Compilation aborted
ja: コンパイルは中断しました

source: Compile {0,choice, 1#module|2#modules} {1}
ja: コンパイル {0,choice, 1\#module|2\#modules} {1}

source: Compile {0,choice, 1#module|2#modules} {1}; production classes
ja: コンパイル {0,choice, 1\#module|2\#modules} {1}; 製品クラス

source: Compiler options
ja: コンパイラ オプション

source: Compiling {0}...
ja: {0} をコンパイル中...

source: Complete Installation
ja: 完全インストール

source: Complete Statement
ja: ステートメントの補完

source: Con&tinue
ja: 続行(&T)

source: Concurrency annotation issues
ja: 並列性注釈問題

source: Condition
ja: 条件

source: Config Folder or Installation Home Required
ja: インストール ホームが必要です

source: Configuration
ja: 設定

source: Configuration test type not specified
ja: テスト タイプの設定が指定されていません

source: Configure Ant
ja: Ant の設定

source: Configure annotations
ja: 注釈の設定

source: Configure...
ja: 設定...

source: Confirm Exit
ja: 終了確認

source: Confirm Remove
ja: 削除の確認

source: Confirm application exit
ja: アプリケーション終了時に確認する

source: Conflict
ja: 競合

source: Conflicts
ja: 競合

source: Connecting to the target VM, address: ''{0}'', transport: ''{1}''
ja: ''{1}'' トランスポートを使用する ''{0}'' で接続しています

source: Connecting to {0}
ja: {0} に接続しています

source: Connection failed with HTTP code {0}
ja: 接続は HTTP コード {0} で失敗しました

source: Console Colors
ja: コンソールの色

source: Constant conditions \& exceptions
ja: 一定条件 \& 例外

source: Constructors
ja: コンストラクタ

source: Content root "{0}" already defined for module "{1}".
ja: コンテント ルート "{0}" はモジュール "{1}" で既に定義されています。

source: Contents are identical
ja: 内容は同一です

source: Contents have differences only in encoding
ja: エンコーディングのみ異なります。

source: Contents have differences only in line separators
ja: 改行記号のみに異なります。

source: Contents have differences only in line separators and encoding
ja: 改行記号とエンコーディングのみ異なります。

source: Contents have differences only in line separators or whitespaces
ja: 改行記号や空白文字のみ異なります。

source: Continuation indent:
ja: 連続インデントの文字数:

source: Continue
ja: 継続

source: Continue Searching
ja: 検索の続行

source: Continue anyway?
ja: 強制的に続行しますか ?

source: Continue?
ja: 続行しますか ?

source: Control flow issues
ja: フロー制御問題

source: Control statement in one line
ja: 制御文を 1 行にする

source: Convert to local
ja: ローカル変数に変換

source: Copy
ja: コピー

source: Copy &JavaDoc
ja: JavaDoc をコピーする(&J)

source: Copy ''{0}'' to temp final variable
ja: ''{0}'' を temp final 変数にコピーする

source: Copy Class refactoring
ja: クラス リファクタリングのコピー

source: Copy Configuration
ja: 設定のコピー

source: Copy Content
ja: 内容のコピー

source: Copy Selected Content
ja: 選択した内容をコピー

source: Copy Template
ja: テンプレートのコピー

source: Copy selected renderer
ja: 選択したレンダラのコピー

source: Copy text to clipboard
ja: テキストをクリップボードにコピー

source: Copy...
ja: コピー...

source: Copy{0} of {1}
ja: {1} の {0} をコピー

source: Correct pattern syntax errors first
ja: 最初によくある構文エラーを修正する

source: Create ''{0}''
ja: {0} の作成

source: Create @interface
ja: @interface の作成

source: Create Accessor for Unused Field
ja: 未使用フィールドのアクセッサの作成

source: Create Class from New
ja: 新規からのクラスの作成

source: Create Class from Usage
ja: 使用箇所からのクラスの作成

source: Create Constant From Usage
ja: 使用箇所からの定数の作成

source: Create Constructor From super() Call
ja: super() 呼び出しからのコンストラクタの作成

source: Create Constructor From this() Call
ja: this() 呼び出しからのコンストラクタの作成

source: Create Constructor from New
ja: 新規からのコンストラクタの作成

source: Create Getter
ja: Getter の作成

source: Create Local Var from instanceof Usage
ja: instanceof の使用箇所からローカル変数を作成

source: Create Local from Usage
ja: 使用箇所からのローカルの作成

source: Create Meta Target
ja: メタ ターゲットの作成

source: Create New Class
ja: 新規クラスの作成

source: Create New Enum
ja: 新規 Enum の作成

source: Create New File
ja: 新規ファイルの作成

source: Create New Interface
ja: 新規インターフェイスの作成

source: Create New Module Group
ja: 新規モジュール グループの作成

source: Create New Subdirectory
ja: 新規サブディレクトリの作成

source: Create Run Configuration
ja: 実行時設定の作成

source: Create Setter
ja: Setter の作成

source: Create Target
ja: ターゲットの作成

source: Create Template
ja: テンプレートの作成

source: Create class ''{0}''
ja: クラス ''{0}'' の作成

source: Create constant field ''{0}''
ja: 定数フィールド {0} の作成

source: Create constructor
ja: コンストラクタの作成

source: Create constructor in ''{0}''
ja: ''{0}'' でのコンストラクタの作成

source: Create constructor matching super
ja: スーパーと一致するコンストラクタを作成する

source: Create directory
ja: ディレクトリの作成

source: Create enum
ja: Enum の作成

source: Create field ''{0}''
ja: フィールド ''{0}'' の作成

source: Create field from Usage
ja: 使用箇所からのフィールドの作成

source: Create file
ja: ファイルの作成

source: Create getter and setter for ''{0}''
ja: ''{0}'' の getter と setter を作成する

source: Create getter for ''{0}''
ja: ''{0}'' の getter を作成する

source: Create interface
ja: インターフェイスの作成

source: Create local variable ''{0}''
ja: ローカル変数 ''{0}'' の作成

source: Create method ''{0}''
ja: メソッド ''{0}'' の作成

source: Create method from usage
ja: 使用箇所からのメソッドの作成

source: Create new directory or package
ja: 新規ディレクトリまたはパッケージの作成

source: Create new file
ja: 新規ファイルを作成します

source: Create new package
ja: 新規パッケージの作成

source: Create package
ja: パッケージの作成

source: Create parameter ''{0}''
ja: パラメータ ''{0}'' の作成

source: Create parameter from Usage
ja: 使用箇所からのパラメータの作成

source: Create property
ja: プロパティの作成

source: Create property From Usage
ja: 使用箇所からのプロパティの作成

source: Create property tag
ja: プロパティ タグの作成

source: Create setter for ''{0}''
ja: ''{0}'' の setter を作成する

source: Create target ''{0}''
ja: ターゲット ''{0}'' の作成

source: Create target tag
ja: ターゲット タグの作成

source: Creating class {0}
ja: クラス {0} を作成しています。

source: Creating file {0}{1}{2}
ja: ファイルの作成{0}{1}{2}

source: Creating interface {0}.{1}
ja: インターフェイス {0} を作成しています。{1}

source: Creating package {0}.{1}
ja: パッケージ {0} を作成しています。{1}

source: Creation of "{0}" failed.
ja: "{0}" の作成に失敗しました。

source: Creation of multi-dimensional arrays not supported
ja: 多次元配列の作成はサポートされていません

source: Current File
ja: 現在のファイル

source: Current value = ''{2}''.
ja: 現在の値 = ''{2}''。

source: Custom folding regions
ja: デフォルトで収縮する項目の指定

source: Customize Data Views
ja: データ ビューのカスタマイズ

source: Customize Highlighting Level
ja: 強調表示レベルのカスタマイズ

source: Customize Threads View
ja: スレッド ビューのカスタマイズ

source: Cycle
ja: 循環

source: Cyclic Module Dependencies
ja: 循環モジュール依存

source: Cyclic scrolling in list
ja: リスト内で循環スクロールする

source: Data error (cyclic redundancy check).
ja: データ エラー (循環冗長チェック)。

source: Data flow issues
ja: データ フロー問題

source: Date
ja: 日付

source: De&lete
ja: 削除(&L)

source: Debug info not available
ja: デバッグ情報は利用できません

source: Debug info unavailable
ja: デバッグ情報は利用できません

source: Debug information is inconsistent
ja: デバッグ情報が矛盾しています

source: Debug libraries are missig from JDK home.nIn order for debugger to start, the libraries should be installed.nPlease visit http://java.sun.com/products/jpda
ja: デバッグ ライブラリが JDK ホームにありません。 デバッガを開始するには、ライブラリをインストールする必要があります。 次を参照してください。http://java.sun.com/products/jpda

source: Debug selected configuration
ja: 選択した設定のデバッグ

source: Debug stopped
ja: デバッグは停止しました

source: Debugger Actions
ja: デバッガのアクション

source: Debugger Settings...
ja: デバッガ設定...

source: Debugger is already listening
ja: デバッガは既に監視しています

source: Debugger is waiting for application to start; debug address: ''{0}''; transport: ''{1}''
ja: デバッガはアプリケーションの開始を待機しています。デバッグ アドレス : ''{0}''、トランスポート : ''{1}''

source: Debugger mode:
ja: デバッガ モード:

source: Debugging is not supported for JDK {0}
ja: デバッグは JDK {0} でサポートされていません

source: Declaration can have final modifier
ja: 宣言は final 修飾子を持てます

source: Declaration has Javadoc problems
ja: 宣言には javadoc に問題があります

source: Declaration has problems in Javadoc references
ja: 宣言には javadocの参照に問題があります

source: Declaration redundancy
ja: 宣言の冗長性

source: Decrease Font Size
ja: フォントサイズ縮小

source: Default &View
ja: デフォルト表示(&V)

source: Default Settings
ja: デフォルト設定

source: Defer assignment to ''{0}'' using temp variable
ja: temp 変数を使用して ''{0}'' への代入を延期する

source: Defer final assignment with temp
ja: temp を使用して最終代入を延期する

source: Delay (ms):
ja: 遅延 (ミリ秒):

source: Delete
ja: 削除

source: Delete All User-Defined Lists Except ''{0}''
ja: "{0}"以外のお気に入りリストをすべて削除

source: Delete Catch
ja: Catch句の削除

source: Delete Favorites List ''{0}''
ja: お気に入りリスト"{0}"の削除

source: Delete catch for ''{0}''
ja: '{0}'' のcatch句を削除する

source: Delete it anyway?
ja: 強制的に削除しますか ?

source: Delete method body
ja: メソッド本体の削除

source: Delete selected Ant configuration?
ja: 選択した Ant 設定を削除しますか ?

source: Delete selected Ant configurations?
ja: 選択した Ant 設定を削除しますか ?

source: Delete unnecessary method(s)
ja: 不要なメソッドを削除する

source: Delete unused parameter(s)
ja: 未使用のパラメータを削除する

source: Delete {0}?
ja: {0} を削除しますか ?

source: Deleted
ja: 削除

source: Deleting
ja: 削除しています

source: Deleting class {0}
ja: クラス {0} を削除しています

source: Dependency rule ''{0}.'' is violated
ja: 依存関係ルール ''{0}.'' に違反しています

source: Depends on:
ja: 依存先 :

source: Deprecated API usage
ja: 非推奨 API の使用方法

source: Deprecated symbol
ja: 非推奨のシンボル

source: Derived Classes
ja: 派生クラス

source: Derived Interfaces
ja: 派生インターフェイス

source: Description
ja: 説明

source: Description is missing in {0} tag for parameter {1}
ja: 説明がパラメータ {1} の {0} タグにありません。

source: Description:
ja: 説明:

source: Description:\&nbsp;{0}
ja: 説明:\&nbsp;{0}

source: Details
ja: 詳細

source: Detects assignments of a variable to itself, like:
ja: 次のような、自身への変数の代入を検出します :

source: Did you know ... ?
ja: ご存知ですか... ?

source: Diff Options
ja: 差分オプション

source: Direct&ory:
ja: ディレクトリ(&D):

source: Direction
ja: 方向

source: Directory
ja: ディレクトリ

source: Directory "{0}" is not found
ja: ディレクトリ {0} は見つかりません

source: Directory ''{0}''
ja: ディレクトリ ''{0}''
